{
  "alora_invocation_tokens": null,
  "alpha_pattern": {
    "down_proj": 512,
    "gate_proj": 512,
    "k_proj": 64,
    "q_proj": 256,
    "up_proj": 256,
    "v_proj": 128
  },
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": "mistralai/Mistral-7B-v0.1",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 128,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.18.0",
  "qalora_group_size": 16,
  "r": 64,
  "rank_pattern": {
    "down_proj": 256,
    "gate_proj": 256,
    "k_proj": 32,
    "q_proj": 128,
    "up_proj": 128,
    "v_proj": 64
  },
  "revision": null,
  "target_modules": [
    "down_proj",
    "k_proj",
    "v_proj",
    "gate_proj",
    "q_proj",
    "up_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": true
}